In [42]:
# Dans cet exercice, nous allons explorer les opérations ensemblistes que nous pouvons appliquer 
# sur les dataframes
# - La projection et la restriction
# - Les opérations ensemblistes (union, différence, intersection)
# - Le produit cartésien
# - Les jointures
# - L'agrégation

In [43]:
# QUESTION : Importer le fichier pays.csv
# REPONSE :

   Unnamed: 0  population    area
0  California    38332521  423967
1       Texas    26448193  695662
2    New York    19651127  141297
3     Florida    19552860  170312
4    Illinois    12882135  149995

In [44]:
# La projection et la restriction
# ------------------------------------------------------
# Commençons par 2 opérations de l'algèbre relationnelle : 
# - la projection est une sélection de certaines colonnes, 
# - la restriction est une sélection de certaines lignes.

print(data)

# QUESTION : faire une projection sur la colonne area
# REPONSE

   Unnamed: 0  population    area
0  California    38332521  423967
1       Texas    26448193  695662
2    New York    19651127  141297
3     Florida    19552860  170312
4    Illinois    12882135  149995

0    423967
1    695662
2    141297
3    170312
4    149995
Name: area, dtype: int64

In [45]:
# QUESTION : faire une restriction sur la ligne =1
# REPONSE

Unnamed: 0       Texas
population    26448193
area            695662
Name: 1, dtype: object

In [46]:
# L'union
# ------------------------------------------------------
# L'union se fait grâce à la fonction pd.concat
# Unir deux tableaux, c'est créer un troisième tableau qui contient toutes les lignes du premier et du second.

# QUESTION : Importer le fichier pays2 et le concaténer avec pays1
# REPONSE :

# QUESTION : que pensez vous des indices ?
# REPONSE :

     Unnamed: 0  population    area
0    California    38332521  423967
1         Texas    26448193  695662
2      New York    19651127  141297
3       Florida    19552860  170312
4      Illinois    12882135  149995
0  Pennsylvanie    12281054  119283
1       Géorgie     8186453  149976

In [47]:
# La jointure
# ------------------------------------------------------

# Une autre fonction très utile pour manipuler les Dataframe est  pd.merge qui effectue une jointure.
# Une jointure, c'est assembler les informations d'un tableau A avec celles d'un tableau B selon un  critère. 
# Ce critère s'appelle la condition de jointure. 
# Ce critère est composée de une ou plusieurs colonnes communes à A et B 

# Un petit exemple. Imaginons que nous disposons de deux Dataframes :
# df1  contenant une liste d'employés et le nom des départements dans lequel ils travaillent,
# df2  contenant la même liste d'employés et leurs dates d'entrée dans l'entreprise.

# La fonction  pd.merge  nous permet de transformer ces deux Dataframes en un seul, contenant les deux informations.
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'department': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'date': [2004, 2008, 2012, 2014]})
df3 = pd.merge(df1, df2)
df2

  employee  date
0     Lisa  2004
1      Bob  2008
2     Jake  2012
3      Sue  2014

In [48]:
# La fonction  pd.merge  a automatiquement reconnu que la colonne employee était commune aux deux Dataframes, 
# et l'a utilisée comme condition de jointure.
# Mais si ces 2 colonnes avaient eu des noms différents (par exemple employee sur df1 et emp_name sur df2), 
# alors il aurait fallu écrire ceci : df3 = pd.merge(df1, df2, left_on= "employee", right_on= "emp_name")

In [49]:
# La cardinalité

# Il y a 3 cardinalités différentes :
# - Un-à-un  : une ligne  du tableau A correspond à une unique ligne du tableau B 
# et une ligne de B correspond à une unique ligne du tableau A.
# - Un-à-plusieurs :  une ligne quelconque de A correspond à une ligne de B, 
# mais une ligne de B peut correspondre à plusieurs lignes de A.
# - Plusieurs-à-plusieurs (many-to-many) :  une ligne de A peut correspondre à plusieurs lignes de B, 
# et une ligne de B peut correspondre à plusieurs lignes de A.

# Selon la cardinalité, le comportement de la jointure ne sera pas le même

In [50]:
# Cardinalité un-à-un
# L'exemple que nous avons pris tout à l'heure correspond à une cardinalité un-à-un. 
# En effet, un employé ne travaille que dans un seul département, et n'a qu'une seule année d'embauche.

In [51]:
# Cardinalité un-à-plusieurs (ou plusieurs-à-un)
# Chaque département a désormais un un chef. 
# Un employé n'a qu'un seul chef, mais un chef peut diriger plusieurs empoyés.

df4 = pd.DataFrame({'department': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})
pd.merge(df3, df4)

# QUESTION : Que remarquez vous dans la colonne supervisor ?
# REPONSE :

  employee   department  date supervisor
0      Bob   Accounting  2008      Carly
1     Jake  Engineering  2012      Guido
2     Lisa  Engineering  2004      Guido
3      Sue           HR  2014      Steve

In [52]:
# Cardinalité plusieurs-à-plusieurs
# df5 contient les compétences nécessaires pour travailler dans chaque département :
# Un employé a besoin de plusieurs compétences, et une compétence peut être partagée par plusieurs employés.

df5 = pd.DataFrame({'department': ['Accounting', 'Accounting',
                              'Engineering', 'Engineering', 'HR', 'HR'],
                    'competence': ['math', 'spreadsheets', 'coding', 'linux',
                               'spreadsheets', 'organization']})

pd.merge(df1, df5)

# QUESTION : Comment interprétez vous les nouvelles lignes.
# REPONSE :

  employee   department    competence
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [53]:
# L'agrégation
# ------------------------------------------------------
# Pandas nous permet d'accomplir une agrégation par groupe, semblable à ce qu'on peut obtenir 
# en utilisant le mot clé  GROUP BY en SQL.
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data1': range(6),
                   'data2': [10,11,10,9,10,10]})                  
print(df)

  key  data1  data2
0   A      0     10
1   B      1     11
2   C      2     10
3   A      3      9
4   B      4     10
5   C      5     10

In [54]:
# Dans Pandas, cette opération se fait en deux étapes. 
# Nous allons d'abord créer un objet de type  DataFrameGroupBy  , que nous appelons  gb  :

gb = df.groupby('key')
# La (les) colonne(s) données dans groupby s'appelle(nt) l' (les) attribut(s) de partitionnement.

In [55]:
# Sur cet objet gb, on peut ensuite appliquer les fonctions d'agrégation :

print(gb.sum())
print(gb.mean())

     data1  data2
key
A        3     19
B        5     21
C        7     20
     data1  data2
key
A      1.5    9.5
B      2.5   10.5
C      3.5   10.0